Mock_2/src/Documents/ЗаказКлиентаМагПэй/ЗаказКлиентаМагПэй.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказКлиентаМагПэй</name>
  <attributes>
    <name>external_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>45</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>reference_number</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>45</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>delivery_address</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>payment_type</name>
    <type>
      <types>EnumRef.СпособыОплатыМагПэй</types>
    </type>
  </attributes>
  <attributes>
    <name>payment_address</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>state</name>
    <type>
      <types>EnumRef.СостоянияЗаказовМагПэй</types>
    </type>
  </attributes>
  <attributes>
    <name>type</name>
    <type>
      <types>EnumRef.ТипыОперацийФискальногоРегистратораМагПэй</types>
    </type>
  </attributes>
  <attributes>
    <name>name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>phone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>id</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>items</name>
    <attributes>
      <name>nomenclature_id</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>45</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>name</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>tax</name>
      <type>
        <types>EnumRef.ТипыНалоговМагПэй</types>
      </type>
    </attributes>
    <attributes>
      <name>quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>price</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Mock_2/src/Documents/ЗаказКлиентаМагПэй/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьДокументНаОснованииПолученныхДанных(ДанныеЗаполнения);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьДокументНаОснованииПолученныхДанных(ДанныеЗаполнения)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	ЭтотОбъект.Дата = ТекущаяДатаСеанса();
	ЭтотОбъект.external_id = СтрШаблон("%1%2", "a", ЭтотОбъект.external_id);
	ЭтотОбъект.id = Новый УникальныйИдентификатор();
	
	Если Не Метаданные.Перечисления.СпособыОплатыМагПэй.ЗначенияПеречисления.Найти(ДанныеЗаполнения.payment_type) = Неопределено Тогда
		ЭтотОбъект.payment_type = Перечисления.СпособыОплатыМагПэй[ДанныеЗаполнения.payment_type];
	КонецЕсли;
	
	Для Каждого Товар Из ДанныеЗаполнения.items Цикл
		
		НоваяСтрока = ЭтотОбъект.items.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Товар);
		Если Не Метаданные.Перечисления.ТипыНалоговМагПэй.ЗначенияПеречисления.Найти(Товар.tax) = Неопределено Тогда
			НоваяСтрока.tax = Перечисления.ТипыНалоговМагПэй[Товар.tax];
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения.client);
	
КонецПроцедуры
